app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Mais um novo"], ["description", "Outro novo article para teste."], ["user_id", 2], ["created_at", "2018-10-26 14:20:44.085553"], ["updated_at", "2018-10-26 14:20:44.085553"]]
---
  def create
		debugger
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "First Article edited"], ["updated_at", "2018-10-24 18:36:03.744865"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)